In [2]:
import pandas as pd

In [3]:
# 열이름을 key, 리스트를 value로 갖는 딕셔너리 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

In [4]:
df = pd.DataFrame(dict_data)

In [5]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [6]:
print(df)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [7]:
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [10]:
# 열이름과 컬럼명 지정
df_02 = pd.DataFrame([[15, '남', '덕영준'], [17,'여','수리중']], index=['준서','예은'], columns=['나이', '성별', '학교'])

In [9]:
df_02

    나이 성별   학교
준서  15  남  덕영준
예은  17  여  수리중

In [12]:
# replace()
df_02.rename(index={'준서':'Jun', '예은':'Yeah'}, inplace=True)

In [13]:
df_02

      나이 성별   학교
Jun   15  남  덕영준
Yeah  17  여  수리중

In [15]:
# drop()
df_02.drop('성별', axis = 1)

      나이   학교
Jun   15  덕영준
Yeah  17  수리중

In [16]:
df_02

      나이 성별   학교
Jun   15  남  덕영준
Yeah  17  여  수리중

In [17]:
# drop()
df_02.drop('성별', axis = 1, inplace=True)

In [18]:
df_02

      나이   학교
Jun   15  덕영준
Yeah  17  수리중

In [22]:
# sort_values
df_02.sort_values(by = '나이', ascending=False)

      나이   학교
Yeah  17  수리중
Jun   15  덕영준